In [ ]:
import pandas as pd

In [58]:
list1 = [10,20,30,40,50]
s1 = pd.Series(list1)
print(s1)
print(type(s1))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [59]:
s1 = pd.Series([10,20,40,60,'amit',9.5])
print(s1) #other way to declare series
print(type(s1))

0      10
1      20
2      40
3      60
4    amit
5     9.5
dtype: object
<class 'pandas.core.series.Series'>

In [60]:
#creation of series from list

Index = ['june','july','aug']
s2 = pd.Series(['amit','shilpa','neha'], index= Index)
print(s2)
print(s2['july'])  #accesing an element

june      amit
july    shilpa
aug       neha
dtype: object
shilpa

In [61]:
Index = [10,20,30,40]   #scalor series
s3 = pd.Series(8,index = Index)
print(s3)

10    8
20    8
30    8
40    8
dtype: int64

#### creation of series from dict
#pass a dict into series method
#also we can pass an numpy array in series method to create a series

#how to create the data frame

In [ ]:
import pandas as pd
data={ 'apple':[2,3,4,5,7,8] ,'mango':[4,5,6,7,9,8]}
print(data)

In [62]:
df=pd.DataFrame(data)
print(df)
print(type(df))

   apple  mango
0      2      4
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8
<class 'pandas.core.frame.DataFrame'>

In [63]:
Index = ['a','b','c','d','e','f']
df=pd.DataFrame(data,index = Index)
print(df)

   apple  mango
a      2      4
b      3      5
c      4      6
d      5      7
e      7      9
f      8      8

In [39]:
import pandas as pd
data={ 'apple':[2,3,4,5,7,8] ,'mango':[4,5,6,7,9,8]}
print(data)
df=pd.DataFrame(data)
print(df)
print(type(df))

{'apple': [2, 3, 4, 5, 7, 8], 'mango': [4, 5, 6, 7, 9, 8]}
   apple  mango
0      2      4
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8
<class 'pandas.core.frame.DataFrame'>


#### selecting the dats

In [40]:
#way 1 selection by indexing
"""
x = df['mango']
print(x)

# way 2 selection by lable(.loc)
x = df.loc['Nitin':'Rohan', 'apple':'mango']
print(x)

"""
#way 3 selection by position/location(.iloc)
x = df.iloc[0:3,0:2]
x

   apple  mango
0      2      4
1      3      5
2      4      6

In [64]:
df.head() #only first 5 rows
print(df.head(3)) #accessing first 3 rows

   apple  mango
a      2      4
b      3      5
c      4      6

In [42]:
df.tail()  #use of tail method for last 5 elements

   apple  mango
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8

In [43]:
df.shape

(6, 2)

In [44]:
df.columns

Index(['apple', 'mango'], dtype='object')

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   apple   6 non-null      int64
 1   mango   6 non-null      int64
dtypes: int64(2)
memory usage: 224.0 bytes

In [46]:
df.describe() #statistatical analysis

          apple     mango
count  6.000000  6.000000
mean   4.833333  6.500000
std    2.316607  1.870829
min    2.000000  4.000000
25%    3.250000  5.250000
50%    4.500000  6.500000
75%    6.500000  7.750000
max    8.000000  9.000000

In [47]:
df.T

       0  1  2  3  4  5
apple  2  3  4  5  7  8
mango  4  5  6  7  9  8

In [48]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [73]:
df.columns = [col.lower() for col in df]  #column names come in lower case
df.columns

Index(['apple', 'mango'], dtype='object')

In [72]:
df.columns = [col.upper() for col in df]  #column names come in upper case
df.columns

Index(['APPLE', 'MANGO'], dtype='object')

In [51]:
#drop column metods
#1
#df.drop(columns=['apple'])
#2
#df.drop(['apple'],axis = 1)
df.drop(labels = [1,4])

   apple  mango
0      2      4
2      4      6
3      5      7
5      8      8

In [52]:
#drop rows method
df.drop([2,3],axis =0)

   apple  mango
0      2      4
1      3      5
4      7      9
5      8      8

In [54]:
import pandas as pd
data={ 'apple':[2,3,4,5,7,8] ,'mango':[4,5,6,7,9,8]}
print(data)
df=pd.DataFrame(data)
print(df)
print(type(df))

tempdf = df.append(df) #to add duplicates in dataset
print(tempdf)

{'apple': [2, 3, 4, 5, 7, 8], 'mango': [4, 5, 6, 7, 9, 8]}
   apple  mango
0      2      4
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8
<class 'pandas.core.frame.DataFrame'>
   apple  mango
0      2      4
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8
0      2      4
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8

In [55]:
tempdf.drop_duplicates() #to remove duplicates

   apple  mango
0      2      4
1      3      5
2      4      6
3      5      7
4      7      9
5      8      8

In [56]:
tempdf.drop_duplicates().shape

(6, 2)

In [57]:
df.isnull().sum()  #to check out missing values from dataset

apple    0
mango    0
dtype: int64

In [66]:
import numpy as np
data={ 'apple':[2,3,np.nan,5,7,8] ,'mango':[4,5,6,np.nan,9,8]}
user_Null_df = pd.DataFrame(data)
user_Null_df

   apple  mango
0    2.0    4.0
1    3.0    5.0
2    NaN    6.0
3    5.0    NaN
4    7.0    9.0
5    8.0    8.0

In [67]:
# Drpna method- deletes the row that contains the null value
user_Null_df.dropna()

   apple  mango
0    2.0    4.0
1    3.0    5.0
4    7.0    9.0
5    8.0    8.0

In [68]:
user_Null_df.dropna(axis = 0) #for row

   apple  mango
0    2.0    4.0
1    3.0    5.0
4    7.0    9.0
5    8.0    8.0

In [69]:
user_Null_df.dropna(axis = 1) #for column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [70]:
# how = 'any' means that even if one is Null, delete it:
user_Null_df.dropna(how = 'all') #row containing all null values get deleted

   apple  mango
0    2.0    4.0
1    3.0    5.0
2    NaN    6.0
3    5.0    NaN
4    7.0    9.0
5    8.0    8.0

In [71]:
user_Null_df.dropna(how = 'all',axis = 1, inplace = True)
user_Null_df

   apple  mango
0    2.0    4.0
1    3.0    5.0
2    NaN    6.0
3    5.0    NaN
4    7.0    9.0
5    8.0    8.0

### To read or import dataset

In [32]:
df = pd.read_csv('housing.csv')
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [33]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [34]:
#way 1 by labels
"""
x = df['households']
x
#way 2 by index(.loc)
"""
x = df.loc[:,'households']
x

0         126.0
1        1138.0
2         177.0
3         219.0
4         259.0
          ...
20635     330.0
20636     114.0
20637     433.0
20638     349.0
20639     530.0
Name: households, Length: 20640, dtype: float64

In [35]:
df.rename(columns={'longitude':'longi','latitude':'lati'},inplace = True)

,longi,lati,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [36]:
df.columns = [col.upper() for col in df]   #columns name come in upper case
df.columns

Index(['LONGITUDE', 'LATITUDE', 'HOUSING_MEDIAN_AGE', 'TOTAL_ROOMS',
       'TOTAL_BEDROOMS', 'POPULATION', 'HOUSEHOLDS', 'MEDIAN_INCOME',
       'MEDIAN_HOUSE_VALUE', 'OCEAN_PROXIMITY'],
      dtype='object')

In [37]:
df.columns = [col.lower() for col in df]  #column names come in lower case
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')